import java.util.Scanner;

public class J4T {
    //Массив анионов
    static String[][] anions = {
            {"OH","-"},
            {"F","-"},
            {"Cl","-"},
            {"Br","-"},
            {"I","-"},
            {"S","2-"},
            {"HS","-"},
            {"SO3","2-"},
            {"HSO3","2-"},
            {"SO4","2-"},
            {"HSO4","-"},
            {"NO3","-"},
            {"NO2","-"},
            {"PO4","3-"},
            {"HPO4","2-"},
            {"H2PO4","-"},
            {"CO3","2-"},
            {"HCO3","-"},
            {"CH3COO","-"},
            {"SiO3","2-"},
            {"MnO4","-"},
            {"Cr2O7","2-"},
            {"CrO4","2-"},
            {"ClO3","-"},
            {"ClO4","-"}
    };
}
